# 1. Посмотрим на нашу формулу силы попротивлеиния:
#     drag force = coefficient * speed * speed.
# Чем быстрее двигается предмет, тем больше сила сопротивления. И если обьект не двигается вообще,
# то на него не действует никакая сила сопротивления. Дополните нашу эмуляцию экспериментом,
# в котором шары падают с разной высоты.
# Как высота с которой падает тело влияет на силу сопротивления в воде?
#
# 2. Формула силы сопротивления содеражит фронтальную площадь поверхности тела,
# которое движется сквозь воду.
# Реализуйте модель квадратов, падающих в воду с вычислением силы сопротивления,
# которая пропорциональна стороне квадрата.
#
# 3. Сила сопротивления движения в жидкости, на самом деле,
# работает не только в направлении противоположном вектору скорости,
# но также и в направлении перпендикулярном вектору скорости.
# Это так называемое сопротивление, вызванное подьемной силой.
# Оно заставляет подниматься самолет, у которого крыло расположенно
# под определенным углом к встречному потоку.
# Попробуйте реализовать эмуляцию подъемной силы.
# https://ru.wikipedia.org/wiki/%D0%9F%D0%BE%D0%B4%D1%8A%D1%91%D0%BC%D0%BD%D0%B0%D1%8F_%D1%81%D0%B8%D0%BB%D0%B0
# http://avia-simply.ru/ugol-ataki-ad-sili/
